driver-tests/bpelse/AtomicTxStart/InOutTxStart/src/inout.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="inout" targetNamespace="http://j2ee.netbeans.org/wsdl/InOutTxStart/inout"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/InOutTxStart/inout" xmlns:ns="http://j2ee.netbeans.org/xsd/tableSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/InOutTxStart/inout">
            <xsd:import namespace="http://j2ee.netbeans.org/xsd/tableSchema" schemaLocation="DETAIL.xsd"/>
        </xsd:schema>
    </types>
    <message name="inoutOperRequest">
        <part name="part1" element="ns:DETAIL"/>
    </message>
    <message name="inoutOperResponse">
        <part name="part1" element="ns:DETAIL"/>
    </message>
    <portType name="inoutPT">
        <operation name="inoutOper">
            <input name="input1" message="tns:inoutOperRequest"/>
            <output name="output1" message="tns:inoutOperResponse"/>
        </operation>
    </portType>
    <binding name="inoutBinding" type="tns:inoutPT">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="inoutOper">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="inoutService">
        <port name="inoutServPort" binding="tns:inoutBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/inoutService/inoutServPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="inout">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="inoutPTRole" portType="tns:inoutPT"/>
    </plnk:partnerLinkType>
</definitions>
