driver-tests/bpelse/AtomicTxStart/InOnlyTxApp/test/TxComplete/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tab="http://j2ee.netbeans.org/xsd/tableSchema">
  <soapenv:Body>
    <tab:DETAIL>
      <!--1 or more repetitions:-->
      <tab:DETAIL_Record>
        <tab:NAME>Hello</tab:NAME>
        <tab:ID>1</tab:ID>
      </tab:DETAIL_Record>
    </tab:DETAIL>
  </soapenv:Body>
</soapenv:Envelope>