driver-tests/bpelse/AtomicTxStart/InOutTxApp/test/InoutDone/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <DETAIL xmlns:msgns="http://j2ee.netbeans.org/wsdl/InOutTxStart/inout" xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
      <DETAIL_Record>
        <NAME xmlns:msgns="http://j2ee.netbeans.org/wsdl/InOutTxStart/CallInoutService" xmlns:ns0="http://j2ee.netbeans.org/wsdl/InOutTxStart/inout">Hello</NAME>
        <ID xmlns:msgns="http://j2ee.netbeans.org/wsdl/InOutTxStart/CallInoutService" xmlns:ns0="http://j2ee.netbeans.org/wsdl/InOutTxStart/inout">1</ID>
      </DETAIL_Record>
    </DETAIL>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
